package com.foxconn.bandon.label.select.model;

import java.util.List;

public class Label {


    /**
     * version : 1.0.4
     * FoodTags : [{"foodBigTag":"蔬菜类","foodSmallTag":["刀豆","黄瓜","苦菜","口蘑","大蒜","小米椒","山药","根芹","木薯","牛肝菌","牛蒡","四季豆","平菇","生菜","小白菜","白菜","白萝卜","石耳","竹笋","竹荪","羊肚菌","西葫芦","西红柿","黄花菜","西芹","灵芝","芋头","豆角","豆芽","油麦菜","空心菜","芥菜头","芦笋","芦蒿","青椒","鱼腥草","南瓜","生姜","扁豆","洋葱","红豆","秋葵","胡萝卜","苤蓝","苦瓜","茄子","韭苔","韭黄","韭菜","香芋","香菜","香椿","茭白","茶树菇","草菇","彩椒","球茎茴香","甜菜根","荸荠","银耳","猴头菇","紫甘蓝","紫苏","紫薯","菜花","菱角","黑木耳","滑子菇","大葱","小葱","荷兰豆","蒜薹","豌豆尖","蕨菜","藕","藠头","蘑菇","丝瓜","圆白菜","番薯叶","红薯","绿豆","荠菜","莼菜","观音菜","贡菜","金针菇","鸡油菌","莲子","豌豆","香菇","卷心菜","菠菜","西兰花","玉米","土豆"]},{"foodBigTag":"水果类","foodSmallTag":["梨子","草莓","西瓜","哈密瓜","桃","榴莲","山竹","荔枝","樱桃","橘子","橙子","葡萄","菠萝蜜","猕猴桃","丑橘","大枣","山楂","青果","李子","木瓜","白果","甜瓜","桑葚","柿子","杏","龙眼","甘蔗","乌梅","柚子","椰子","杨桃","杨梅","香瓜","蓝莓","金桔","西柚","橄榄","蛇果","黑布林","枇杷","圣女果","无花果","罗汉果","栗子","芭乐","石榴","核桃","菠萝","苹果","柠檬","火龙果","芒果","香蕉"]},{"foodBigTag":"禽肉蛋品","foodSmallTag":["鸡胗","鸭蛋","鸽肉","鸡爪","乌骨鸡","火鸡","鹅肝","鸡翅","鸭掌","鸭脖","鹌鹑蛋","鸡蛋","皮蛋","鸡肉","鹅肉","鸭肉"]},{"foodBigTag":"猪牛羊肉","foodSmallTag":["香肠","牛肚","猪大肠","肥牛","猪耳朵","腊肉","牛腩","牛腱","猪蹄","排骨","羊肉"]},{"foodBigTag":"海鲜水产","foodSmallTag":["鱿鱼","蛤蜊","扇贝","秋刀鱼","龙虾","章鱼","鲈鱼","鳕鱼","海带","田螺","鲫鱼","黄骨鱼","濑尿虾","花甲","鲍鱼","河蚌","鲶鱼","甲鱼","黄鳝","鲟鱼","草鱼","鲳鱼","沙丁鱼","石斑鱼","鳊鱼","海胆","多宝鱼","蚬子","泥鳅","三文鱼","虾","螃蟹","生蚝","海参"]},{"foodBigTag":"饮品类","foodSmallTag":["啤酒","雪碧","柠檬茶","宝矿力","加多宝","椰子汁","乳酸饮品","酸梅汤","豆奶","气泡水","矿泉水","橙汁","米酒","红酒","苹果醋","菠萝啤","芭乐汁","可乐","酸奶","王老吉","维他奶","牛奶"]},{"foodBigTag":"调味料","foodSmallTag":["辣椒酱","鸡粉","黄豆酱","番茄沙司","炼奶","豆瓣酱","豆腐乳","白砂糖","花生酱","黑胡椒酱","芝麻油","沙茶酱","味精","麻油","沙拉酱","陈醋","鱼露","蜂蜜","桂皮","八角","豆豉","五香粉","十三香","咖喱粉","XO酱","花椒","芥末","虾酱","酱油","蚝油","盐","椒盐粉","白醋"]},{"foodBigTag":"冷冻食品","foodSmallTag":["手抓饼","烧卖","煎包","火锅饺","紫薯包","鸡块","芝麻球","盐酥鸡","馒头","冰棍","牛肉卷","羊肉卷","牛肉丸","墨鱼丸","虾饺","猪肉水饺","奶黄包","冰淇淋","叉烧包","薯条"]}]
     */

    private String version;
    private List<FoodTagsBean> FoodTags;

    public String getVersion() {
        return version;
    }

    public void setVersion(String version) {
        this.version = version;
    }

    public List<FoodTagsBean> getFoodTags() {
        return FoodTags;
    }

    public void setFoodTags(List<FoodTagsBean> FoodTags) {
        this.FoodTags = FoodTags;
    }

    public static class FoodTagsBean {
        /**
         * foodBigTag : 蔬菜类
         * foodSmallTag : ["刀豆","黄瓜","苦菜","口蘑","大蒜","小米椒","山药","根芹","木薯","牛肝菌","牛蒡","四季豆","平菇","生菜","小白菜","白菜","白萝卜","石耳","竹笋","竹荪","羊肚菌","西葫芦","西红柿","黄花菜","西芹","灵芝","芋头","豆角","豆芽","油麦菜","空心菜","芥菜头","芦笋","芦蒿","青椒","鱼腥草","南瓜","生姜","扁豆","洋葱","红豆","秋葵","胡萝卜","苤蓝","苦瓜","茄子","韭苔","韭黄","韭菜","香芋","香菜","香椿","茭白","茶树菇","草菇","彩椒","球茎茴香","甜菜根","荸荠","银耳","猴头菇","紫甘蓝","紫苏","紫薯","菜花","菱角","黑木耳","滑子菇","大葱","小葱","荷兰豆","蒜薹","豌豆尖","蕨菜","藕","藠头","蘑菇","丝瓜","圆白菜","番薯叶","红薯","绿豆","荠菜","莼菜","观音菜","贡菜","金针菇","鸡油菌","莲子","豌豆","香菇","卷心菜","菠菜","西兰花","玉米","土豆"]
         */

        private String foodBigTag;
        private List<String> foodSmallTag;

        public String getFoodBigTag() {
            return foodBigTag;
        }

        public void setFoodBigTag(String foodBigTag) {
            this.foodBigTag = foodBigTag;
        }

        public List<String> getFoodSmallTag() {
            return foodSmallTag;
        }

        public void setFoodSmallTag(List<String> foodSmallTag) {
            this.foodSmallTag = foodSmallTag;
        }
    }
}
